app/views/home/index.html.erb

SELECT "categories".* FROM "categories"
---

        <%= collection_select :categories, :category_id, Category.all, :number, :name , prompt: "Categories"%>